# RebarSystemLayerSummaryNoSpacing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarSystemLayerSummaryNoSpacing Property
ParameterTypeId Class See Also
---
"Layer Summary (Brief)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemLayerSummaryNoSpacing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemLayerSummaryNoSpacing As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemLayerSummaryNoSpacing {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace